---
kind: property
id: P:Autodesk.Revit.DB.Events.ViewPrintingEventArgs.TotalViews
source: html/3dfbad53-1e61-ea1f-23d4-46bb26e631f5.htm
---
# Autodesk.Revit.DB.Events.ViewPrintingEventArgs.TotalViews Property

The number of all views being printed.

## Syntax (C#)
```csharp
public int TotalViews { get; }
```